In [1]:
import numpy as np

In [3]:
x=np.array([[1,2,3]])
print(x.shape)

y = np.array([[4],[5]])
print(y.shape)

(1, 3)
(2, 1)

In [6]:
x,y =np.broadcast_arrays(x,y)
x

array([[1, 2, 3],
       [1, 2, 3]])

In [7]:
y

array([[4, 4, 4],
       [5, 5, 5]])

# Pandas

In [2]:
import pandas as pd

In [9]:
 s1 = pd.Series([11,22,33,44,55,66,77,88,99,100])

In [10]:
s1

0     11
1     22
2     33
3     44
4     55
5     66
6     77
7     88
8     99
9    100
dtype: int64

In [11]:
# 0-9 default index provided by series object

In [12]:
s1[9] #accessing value by index

100

In [14]:
s1[[2,4,7,9,0]] #accessing multiple values

2     33
4     55
7     88
9    100
0     11
dtype: int64

In [15]:
s1[5] = 3333 #modifying a value

In [16]:
s1[5]

3333

In [17]:
del s1[5] #deleting a value

In [19]:
s1

0     11
1     22
2     33
3     44
4     55
6     77
7     88
8     99
9    100
dtype: int64

In [20]:
s1[[1,2,3,4]] = 111,222,333,444 #modifying multiple values

In [21]:
s1

0     11
1    111
2    222
3    333
4    444
6     77
7     88
8     99
9    100
dtype: int64

In [28]:
s1[22] = 56
s1[[11,44,33]] = 54,23,12

ValueError: [11 44 33] not contained in the index

In [27]:
s1

0      11
1     111
2     222
3     333
4     444
6      77
7      88
8      99
9     100
22     56
dtype: int64

# Defining our own indexes

In [29]:
s2 = pd.Series([10,20,30,40], index=["oranges","apples","bananas","kiwi"])

In [30]:
s2

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [31]:
s2.index

Index(['oranges', 'apples', 'bananas', 'kiwi'], dtype='object')

In [33]:
print(s2.values)

[10 20 30 40]

In [34]:
s2>30

oranges    False
apples     False
bananas    False
kiwi        True
dtype: bool

In [35]:
s2[s2>30]

kiwi    40
dtype: int64

In [37]:
s2[s2<30]

oranges    10
apples     20
dtype: int64

In [38]:
'mango' in s2

False

In [39]:
'oranges' in s2

True

In [40]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [47]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [48]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [50]:
obj4['California'] = 20000

In [51]:
obj4

California    20000.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [52]:
obj4.notnull()

California    True
Ohio          True
Oregon        True
Texas         True
dtype: bool

# DataFrame

In [73]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [74]:
df1['pop'] #recommended

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [75]:
df1.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [76]:
df1[['pop','state']]

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [77]:
del df1['pop']

In [78]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [68]:
df1['debt'] = 10000

In [69]:
df1

    state  year   debt
0    Ohio  2000  10000
1    Ohio  2001  10000
2    Ohio  2002  10000
3  Nevada  2001  10000
4  Nevada  2002  10000
5  Nevada  2003  10000

In [70]:
df1['debt'] = [11000,12000,13000,14000,15000,16000]

In [71]:
df1

    state  year   debt
0    Ohio  2000  11000
1    Ohio  2001  12000
2    Ohio  2002  13000
3  Nevada  2001  14000
4  Nevada  2002  15000
5  Nevada  2003  16000

In [79]:
df1['debt'] = df1['state']

In [80]:
df1

    state  year    debt
0    Ohio  2000    Ohio
1    Ohio  2001    Ohio
2    Ohio  2002    Ohio
3  Nevada  2001  Nevada
4  Nevada  2002  Nevada
5  Nevada  2003  Nevada

In [81]:
df1['debt'] = range(6)

In [82]:
df1

    state  year  debt
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4
5  Nevada  2003     5

In [15]:
dic = {'AI for E1':[85,40,71,57,84,97],
       'Python1':[71,30,84,31,67,80],
       'Python2':[57,50,97,67,80,98]}
df2 = pd.DataFrame(dic, index=['A','B','C','D','E','F'])
df2

   AI for E1  Python1  Python2
A         85       71       57
B         40       30       50
C         71       84       97
D         57       31       67
E         84       67       80
F         97       80       98

In [19]:
df2['Total'] = df2['AI for E1']+df2['Python1']+df2['Python2']

In [20]:
df2

   AI for E1  Python1  Python2  total marks  Total
A         85       71       57          213    213
B         40       30       50          120    120
C         71       84       97          252    252
D         57       31       67          155    155
E         84       67       80          231    231
F         97       80       98          275    275

In [23]:
df2['Status'] = ['Pass' if marks>=200 else 'Fails' for marks in df2.Total]
df2

   AI for E1  Python1  Python2  total marks  Total Status
A         85       71       57          213    213   Pass
B         40       30       50          120    120  Fails
C         71       84       97          252    252   Pass
D         57       31       67          155    155  Fails
E         84       67       80          231    231   Pass
F         97       80       98          275    275   Pass

In [ ]:
df2['Status2'] = [if a<=33for a,p1,p2 in zip(df2['AI for E1'],df2['Python1'],df2['Python2'])]

In [27]:
df2['Status3'] = np.where(((df2['AI for E1']<50)& (df2['Python1']<50) & (df2['Python2']<50)),"fail" , "pass")

In [28]:
df2

   AI for E1  Python1  Python2  total marks  Total Status Status3
A         85       71       57          213    213   Pass    pass
B         40       30       50          120    120  Fails    pass
C         71       84       97          252    252   Pass    pass
D         57       31       67          155    155  Fails    pass
E         84       67       80          231    231   Pass    pass
F         97       80       98          275    275   Pass    pass

# 13-Oct-19

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [30]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [36]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'])

In [37]:
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [38]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'], index=['A','B','C','D','E','F'])

In [39]:
frame

   year   state  pop
A  2000    Ohio  1.5
B  2001    Ohio  1.7
C  2002    Ohio  3.6
D  2001  Nevada  2.4
E  2002  Nevada  2.9
F  2003  Nevada  3.2

In [42]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'], index=['one', 'two', 'three', 'four','five', 'six'])
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [45]:
frame.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [46]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [47]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [48]:
frame.debt = val

In [49]:
frame

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [50]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [58]:
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [55]:
frame2 = pd.DataFrame(pop, index=[2001, 2002, 2003])
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
frame4 = pd.DataFrame(pdata)
frame4

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [61]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [62]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

# Reindexing on Series

In [63]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [64]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [65]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [72]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [71]:
obj3.reindex(range(6), method='ffill')   #ffil>>forwad fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [70]:
obj3.reindex(range(6), method='bfill')   #bfill>>backward fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

# Reindexing on Dataframe

In [5]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
        index=['a', 'c', 'd'],
        columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [6]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [77]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [7]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [8]:
frame2.reindex(index=['f','b','a','d','c','g'],columns=['Texas','Newyork','Utah','California','Bay'])

   Texas  Newyork  Utah  California  Bay
f    NaN      NaN   NaN         NaN  NaN
b    NaN      NaN   NaN         NaN  NaN
a    1.0      NaN   NaN         2.0  NaN
d    7.0      NaN   NaN         8.0  NaN
c    4.0      NaN   NaN         5.0  NaN
g    NaN      NaN   NaN         NaN  NaN

In [14]:
frame4 = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=list('abcde'),index=range(1,101,5))
frame4

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [15]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [16]:
frame2.loc['c']

Ohio          3.0
Texas         4.0
California    5.0
Name: c, dtype: float64

In [17]:
frame2.loc['c']['California']

5.0

In [18]:
frame2.loc['c'][2]

5.0

In [19]:
frame2.loc[::-1]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   NaN    NaN         NaN
a   0.0    1.0         2.0

In [20]:
frame2.loc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [21]:
frame2.loc['a':'c']   #loc[start:end]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [22]:
frame2.iloc[:2]    #iloc[start:end-1]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN